## Staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         NAME                         |
|----------|------------------------------------------------------|
| recreate | `aws_route53_record.api-lambda-notification-A`       |
|          | `aws_route53_record.api-notification-alt-A[0]`       |
|          | `aws_route53_record.api-weighted-100-notification-A` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.api-lambda-notification-A must be replaced
-/+ resource "aws_route53_record" "api-lambda-notification-A" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api-lambda.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_api-lambda.staging.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "api-lambda.staging.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "ZQSVJUPU6J1EY" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.api-notification-alt-A[0] must be replaced
-/+ resource "aws_route53_record" "api-notification-alt-A" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api.staging.alpha.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_api.staging.alpha.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "api.staging.alpha.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "ZQSVJUPU6J1EY" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.api-weighted-100-notification-A must be replaced
-/+ resource "aws_route53_record" "api-weighted-100-notification-A" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_api.staging.notification.cdssandbox.xyz_A_lambda" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "api.staging.notification.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "ZQSVJUPU6J1EY" # forces replacement
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
